export default function Banner() {
    return (
        <div className='mb-5 grid grid-cols-1 h-full max-w-6xl mx-auto gap-5'>
            <div
                className="flex justify-center w-full bg-black h-[700px] rounded-2xl overflow-hidden shadow-2xl"
                style={{ aspectRatio: '9/16' }}
            >
                <iframe
                    src={`https://www.youtube.com/embed/al4hTmrfmmM`}
                    className="w-full h-full"
                    allowFullScreen
                    allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture"
                    title="Product Video"
                ></iframe>
            </div>

            <div className="flex justify-center items-center mt-4">
                <a
                    className="bg-red-500 text-4xl text-center px-3 py-2 rounded-2xl"
                    type="button"
                    href="#order-form"
                >অর্ডার করতে চাই</a>
            </div>

            <h3 className="text-gray-800 text-xl">
                <>
                    ৩৫% ডিসকাউন্ট চলছে আমাদের ওয়েবসাইটে <br />
                    আমরা কোন টাকা অগ্রিম নেই না। <br />
                    ড্রেস হাতে পেয়ে খুলে দেখে টাকা পরিশোধ করবেন। <br />
                    ইনশাআল্লাহ ড্রেসটি যেমন সুন্দর দেখেছেন হুবহু তেমন সুন্দর পাবেন। <br />
                    👘 কামিজ: প্রিমিয়াম ভেলবেট তৈরি , আরামের সাথে আভিজাত্যের মিশ্রণ <br />
                    🧣 ওড়না: কিসমিস জর্জেট , যা ড্রেসটিকে দিয়েছে সুন্দর শেড <br />
                    👖 প্যান্ট: ভেলবেট , নরম ও স্মুথ <br />
                    আপনি অর্ডার করার পরে আমরা কল করে আপনার সাইজ জেনে নিব এবং সেই সাইজ অনুযায়ী সেলাই করে প্রোডাক্ট পাঠাবো। <br />
                    আপনি চাইলে সেলাই ছাড়াও নিতে পারেন। <br />
                    প্রোডাক্ট খুলে দেখে তারপরে মূল্য দিবেন। <br />
                    যদি আপনার একের অধিক প্রোডাক্ট লাগে আমরা যখন কল দিবো তখন আমাদেরকে জানিয়ে দিলেই যতগুলো চাইবেন পাঠানো হবে। <br />
                    আমাদের দ্বারা কোনো ভুল হলে সেইটার ক্ষতিপূরণ আমরা দিবো। <br />
                    তবে ইনশাআল্লাহ কোনো ভুল হবেনা। <br />
                    আপনার আরো কোনো প্রশ্ন থাকলে অর্ডার করে রাখুন আমরা কল দিলে আপনার প্রশ্নের উত্তর গুলো জেনে নিবেন। <br />
                    ধন্যবাদ।
                </>
            </h3>
        </div>
    )
}
